app/controllers/home_controller.rb

  def index
    @levels = Level.all
---
SELECT `levels`.* FROM `levels`