app/controllers/levels_controller.rb

  def index
    @levels = Level.all
---
SELECT `levels`.* FROM `levels`

  def create
    @level = Level.new(params.require(:level)
                             .permit(:name, :description, :image_path))

    image = params[:level][:image_path]
    if image != nil
      filename = image.original_filename
      filepath = "#{Rails.root}/public/upload/#{filename}"
      File.open("#{filepath}", "wb") do |f|
    	   f.write(image.read)
      end
      @level.image_path = "/upload/#{filename}"
    end

    if @level.save
---
INSERT INTO `levels` (`name`, `description`, `image_path`, `created_at`, `updated_at`) VALUES ('賈伯斯', '美國蘋果的創辦人是誰？', '/Users/gn01964422/GitHub/Findout/public/upload/steven_jobsS.jpg', '2016-12-02 15:35:57', '2016-12-02 15:35:57')

  def destroy
    @level = Level.find params[:id]

    Option.destroy_all(level_id: @level.id)
---
SELECT  `levels`.* FROM `levels` WHERE `levels`.`id` = 3 LIMIT 1
DELETE FROM `levels` WHERE `levels`.`id` = 3